ahtn/keyplus/efm8/efm8/mcu/C8051F300/inc/SI_C8051F300_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F300_GM
//  C8051F300_GS
//  C8051F301_GM
//  C8051F301_GS
//  C8051F302_GM
//  C8051F302_GS
//  C8051F303_GM
//  C8051F303_GS
//  C8051F304_GM
//  C8051F304_GS
//  C8051F305_GM
//  C8051F305_GS

#ifndef SI_C8051F300_REGISTER_ENUMS_H
#define SI_C8051F300_REGISTER_ENUMS_H

//Standard device includes
#include "SI_C8051F300_Defs.h"
//------------------------------------------------------------------------------
// ADC0 Enums (ADC0 Data Word @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0_ADC0__FMASK 0xFF ///< Data Word
#define ADC0_ADC0__SHIFT 0x00 ///< Data Word
                                            
//------------------------------------------------------------------------------
// ADC0CF Enums (ADC0 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0CF_AMP0GN__FMASK    0x03 ///< Gain Control                
#define ADC0CF_AMP0GN__SHIFT    0x00 ///< Gain Control                
#define ADC0CF_AMP0GN__GAIN_0P5 0x00 ///< The on-chip PGA gain is 0.5.
#define ADC0CF_AMP0GN__GAIN_1   0x01 ///< The on-chip PGA gain is 1.  
#define ADC0CF_AMP0GN__GAIN_2   0x02 ///< The on-chip PGA gain is 2.  
#define ADC0CF_AMP0GN__GAIN_4   0x03 ///< The on-chip PGA gain is 4.  
                                                                      
#define ADC0CF_ADSC__FMASK      0xF8 ///< SAR Clock Divider           
#define ADC0CF_ADSC__SHIFT      0x03 ///< SAR Clock Divider           
                                                                      
//------------------------------------------------------------------------------
// ADC0CN Enums (ADC0 Control @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN_ADCM__FMASK         0x07 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__SHIFT         0x00 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__ADBUSY        0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN_ADCM__TIMER0        0x01 ///< ADC0 conversion initiated on overflow of Timer 0. 
#define ADC0CN_ADCM__TIMER2        0x02 ///< ADC0 conversion initiated on overflow of Timer 2. 
#define ADC0CN_ADCM__TIMER1        0x03 ///< ADC0 conversion initiated on overflow of Timer 1. 
#define ADC0CN_ADCM__CNVSTR        0x04 ///< ADC0 conversion initiated on rising edge of       
                                        ///< CNVSTR.                                           
                                                                                               
#define ADC0CN_ADWINT__BMASK       0x08 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__SHIFT       0x03 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__NOT_SET     0x00 ///< An ADC window compare event did not occur.        
#define ADC0CN_ADWINT__SET         0x08 ///< An ADC window compare event occurred.             
                                                                                               
#define ADC0CN_ADBUSY__BMASK       0x10 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__SHIFT       0x04 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__NOT_SET     0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0CN_ADBUSY__SET         0x10 ///< ADC0 conversion is in progress or start an ADC0   
                                        ///< conversion.                                       
                                                                                               
#define ADC0CN_ADINT__BMASK        0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__SHIFT        0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__NOT_SET      0x00 ///< ADC0 has not completed a conversion since the last
                                        ///< time ADINT was cleared.                           
#define ADC0CN_ADINT__SET          0x20 ///< ADC0 completed a data conversion.                 
                                                                                               
#define ADC0CN_ADTM__BMASK         0x40 ///< Track Mode                                        
#define ADC0CN_ADTM__SHIFT         0x06 ///< Track Mode                                        
#define ADC0CN_ADTM__TRACK_NORMAL  0x00 ///< Normal Track Mode. When ADC0 is enabled,          
                                        ///< conversion begins immediately following the start-
                                        ///< of-conversion signal.                             
#define ADC0CN_ADTM__TRACK_DELAYED 0x40 ///< Delayed Track Mode. When ADC0 is enabled,         
                                        ///< conversion begins 3 SAR clock cycles following the
                                        ///< start-of-conversion signal. The ADC is allowed to 
                                        ///< track during this time. Note that there is not a  
                                        ///< tracking delay when the external conversion start 
                                        ///< (CNVSTR) is used as the start-of-conversion       
                                        ///< source.                                           
                                                                                               
#define ADC0CN_ADEN__BMASK         0x80 ///< ADC Enable                                        
#define ADC0CN_ADEN__SHIFT         0x07 ///< ADC Enable                                        
#define ADC0CN_ADEN__DISABLED      0x00 ///< ADC0 Disabled (low-power shutdown).               
#define ADC0CN_ADEN__ENABLED       0x80 ///< ADC0 Enabled (active and ready for data           
                                        ///< conversions).                                     
                                                                                               
//------------------------------------------------------------------------------
// ADC0GT Enums (ADC0 Greater-Than Threshold @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GT_ADC0GT__FMASK 0xFF ///< Greater-Than Threshold
#define ADC0GT_ADC0GT__SHIFT 0x00 ///< Greater-Than Threshold
                                                             
//------------------------------------------------------------------------------
// ADC0LT Enums (ADC0 Less-Than Threshold @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LT_ADC0LT__FMASK 0xFF ///< Less-Than Threshold
#define ADC0LT_ADC0LT__SHIFT 0x00 ///< Less-Than Threshold
                                                          
//------------------------------------------------------------------------------
// AMX0SL Enums (AMUX0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define AMX0SL_AMX0P__FMASK  0x0F ///< AMUX0 Positive Input Selection
#define AMX0SL_AMX0P__SHIFT  0x00 ///< AMUX0 Positive Input Selection
#define AMX0SL_AMX0P__ADC0P0 0x00 ///< Select ADC0P.0.               
#define AMX0SL_AMX0P__ADC0P1 0x01 ///< Select ADC0P.1.               
#define AMX0SL_AMX0P__ADC0P2 0x02 ///< Select ADC0P.2.               
#define AMX0SL_AMX0P__ADC0P3 0x03 ///< Select ADC0P.3.               
#define AMX0SL_AMX0P__ADC0P4 0x04 ///< Select ADC0P.4.               
#define AMX0SL_AMX0P__ADC0P5 0x05 ///< Select ADC0P.5.               
#define AMX0SL_AMX0P__ADC0P6 0x06 ///< Select ADC0P.6.               
#define AMX0SL_AMX0P__ADC0P7 0x07 ///< Select ADC0P.7.               
#define AMX0SL_AMX0P__TEMP   0x08 ///< Temperature sensor.           
#define AMX0SL_AMX0P__VDD    0x09 ///< VDD Supply Voltage.           
                                                                     
#define AMX0SL_AMX0N__FMASK  0xF0 ///< AMUX0 Negative Input Selection
#define AMX0SL_AMX0N__SHIFT  0x04 ///< AMUX0 Negative Input Selection
#define AMX0SL_AMX0N__ADC0N0 0x00 ///< Select ADC0N.0.               
#define AMX0SL_AMX0N__ADC0N1 0x10 ///< Select ADC0N.1.               
#define AMX0SL_AMX0N__ADC0N2 0x20 ///< Select ADC0N.2.               
#define AMX0SL_AMX0N__ADC0N3 0x30 ///< Select ADC0N.3.               
#define AMX0SL_AMX0N__ADC0N4 0x40 ///< Select ADC0N.4.               
#define AMX0SL_AMX0N__ADC0N5 0x50 ///< Select ADC0N.5.               
#define AMX0SL_AMX0N__ADC0N6 0x60 ///< Select ADC0N.6.               
#define AMX0SL_AMX0N__ADC0N7 0x70 ///< Select ADC0N.7.               
#define AMX0SL_AMX0N__GND    0x80 ///< Ground (single-ended mode).   
                                                                     
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
