ahtn/keyplus/efm8/efm8/mcu/C8051F300/inc/SI_C8051F300_Register_Enums.h
#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.           
                                                                                             
//------------------------------------------------------------------------------
// OSCICL Enums (High Frequency Oscillator Calibration @ 0xB3)
//------------------------------------------------------------------------------
#define OSCICL_OSCICL__FMASK 0x7F ///< Internal Oscillator Calibration
#define OSCICL_OSCICL__SHIFT 0x00 ///< Internal Oscillator Calibration
                                                                      
//------------------------------------------------------------------------------
// OSCICN Enums (High Frequency Oscillator Control @ 0xB2)
//------------------------------------------------------------------------------
#define OSCICN_IFCN__FMASK          0x03 ///< Oscillator Frequency Divider Control              
#define OSCICN_IFCN__SHIFT          0x00 ///< Oscillator Frequency Divider Control              
#define OSCICN_IFCN__HFOSC_DIV_8    0x00 ///< SYSCLK derived from High Frequency Oscillator     
                                         ///< divided by 8.                                     
#define OSCICN_IFCN__HFOSC_DIV_4    0x01 ///< SYSCLK derived from High Frequency Oscillator     
                                         ///< divided by 4.                                     
#define OSCICN_IFCN__HFOSC_DIV_2    0x02 ///< SYSCLK derived from High Frequency Oscillator     
                                         ///< divided by 2.                                     
#define OSCICN_IFCN__HFOSC_DIV_1    0x03 ///< SYSCLK derived from High Frequency Oscillator     
                                         ///< divided by 1.                                     
                                                                                                
#define OSCICN_IOSCEN__BMASK        0x04 ///< Oscillator Enable                                 
#define OSCICN_IOSCEN__SHIFT        0x02 ///< Oscillator Enable                                 
#define OSCICN_IOSCEN__DISABLED     0x00 ///< Disable the High Frequency Oscillator.            
#define OSCICN_IOSCEN__ENABLED      0x04 ///< Enable the High Frequency Oscillator.             
                                                                                                
#define OSCICN_CLKSL__BMASK         0x08 ///< Clock Source Select                               
#define OSCICN_CLKSL__SHIFT         0x03 ///< Clock Source Select                               
#define OSCICN_CLKSL__DIVIDED_HFOSC 0x00 ///< Clock (SYSCLK) derived from the Internal precision
                                         ///< High-Frequency Oscillator and scaled per the IFCN 
                                         ///< bits.                                             
#define OSCICN_CLKSL__EXTOSC        0x08 ///< Clock (SYSCLK) derived from the External          
                                         ///< Oscillator circuit.                               
                                                                                                
#define OSCICN_IFRDY__BMASK         0x10 ///< Oscillator Frequency Ready Flag                   
#define OSCICN_IFRDY__SHIFT         0x04 ///< Oscillator Frequency Ready Flag                   
#define OSCICN_IFRDY__NOT_SET       0x00 ///< The Internal High Frequency Oscillator is not     
                                         ///< running at the programmed frequency.              
#define OSCICN_IFRDY__SET           0x10 ///< The Internal High Frequency Oscillator is running 
                                         ///< at the programmed frequency.                      
                                                                                                
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK     0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT     0x00 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED   0x01 ///< Enable interrupt requests generated by SMB0.      
                                                                                          
#define EIE1_EWADC0__BMASK    0x02 ///< Window Comparison ADC0 Interrupt Enable           
#define EIE1_EWADC0__SHIFT    0x01 ///< Window Comparison ADC0 Interrupt Enable           
#define EIE1_EWADC0__DISABLED 0x00 ///< Disable ADC0 Window Comparison interrupt.         
#define EIE1_EWADC0__ENABLED  0x02 ///< Enable interrupt requests generated by ADC0 Window
                                   ///< Compare flag (ADWINT).                            
                                                                                          
#define EIE1_EADC0__BMASK     0x04 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__SHIFT     0x02 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__DISABLED  0x00 ///< Disable ADC0 Conversion Complete interrupt.       
#define EIE1_EADC0__ENABLED   0x04 ///< Enable interrupt requests generated by the ADINT  
                                   ///< flag.                                             
                                                                                          
#define EIE1_EPCA0__BMASK     0x08 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT     0x03 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED  0x00 ///< Disable all PCA0 interrupts.                      
#define EIE1_EPCA0__ENABLED   0x08 ///< Enable interrupt requests generated by PCA0.      
                                                                                          
#define EIE1_ECP0F__BMASK     0x10 ///< Comparator0 (CP0) Falling Edge Interrupt Enable   
#define EIE1_ECP0F__SHIFT     0x04 ///< Comparator0 (CP0) Falling Edge Interrupt Enable   
#define EIE1_ECP0F__DISABLED  0x00 ///< Disable CP0 falling edge interrupts.              
#define EIE1_ECP0F__ENABLED   0x10 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPFIF flag.                          
                                                                                          
#define EIE1_ECP0R__BMASK     0x20 ///< Comparator0 (CP0) Rising Edge Interrupt Enable    
#define EIE1_ECP0R__SHIFT     0x05 ///< Comparator0 (CP0) Rising Edge Interrupt Enable    
#define EIE1_ECP0R__DISABLED  0x00 ///< Disable CP0 rising edge interrupts.               
#define EIE1_ECP0R__ENABLED   0x20 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPRIF flag.                          
                                                                                          
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__LOW    0x00 ///< SMB0 interrupt set to low priority level.                   
#define EIP1_PSMB0__HIGH   0x01 ///< SMB0 interrupt set to high priority level.                  
                                                                                                 
