ahtn/keyplus/efm8/efm8/mcu/C8051F300/inc/SI_C8051F300_Register_Enums.h
#define EIP1_PWADC0__BMASK 0x02 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__SHIFT 0x01 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Window interrupt set to low priority level.            
#define EIP1_PWADC0__HIGH  0x02 ///< ADC0 Window interrupt set to high priority level.           
                                                                                                 
#define EIP1_PADC0__BMASK  0x04 ///< ADC0 Conversion Complete Interrupt Priority Control         
#define EIP1_PADC0__SHIFT  0x02 ///< ADC0 Conversion Complete Interrupt Priority Control         
#define EIP1_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt set to low               
                                ///< priority level.                                             
#define EIP1_PADC0__HIGH   0x04 ///< ADC0 Conversion Complete interrupt set to high              
                                ///< priority level.                                             
                                                                                                 
#define EIP1_PPCA0__BMASK  0x08 ///< Programmable Counter Array (PCA0) Interrupt Priority Control
#define EIP1_PPCA0__SHIFT  0x03 ///< Programmable Counter Array (PCA0) Interrupt Priority Control
#define EIP1_PPCA0__LOW    0x00 ///< PCA0 interrupt set to low priority level.                   
#define EIP1_PPCA0__HIGH   0x08 ///< PCA0 interrupt set to high priority level.                  
                                                                                                 
#define EIP1_PCP0F__BMASK  0x10 ///< Comparator0 (CP0) Falling Edge Interrupt Priority Control   
#define EIP1_PCP0F__SHIFT  0x04 ///< Comparator0 (CP0) Falling Edge Interrupt Priority Control   
#define EIP1_PCP0F__LOW    0x00 ///< CP0 falling edge interrupt set to low priority              
                                ///< level.                                                      
#define EIP1_PCP0F__HIGH   0x10 ///< CP0 falling edge interrupt set to high priority             
                                ///< level.                                                      
                                                                                                 
#define EIP1_PCP0R__BMASK  0x20 ///< Comparator0 (CP0) Rising Edge Interrupt Priority Control    
#define EIP1_PCP0R__SHIFT  0x05 ///< Comparator0 (CP0) Rising Edge Interrupt Priority Control    
#define EIP1_PCP0R__LOW    0x00 ///< CP0 rising edge interrupt set to low priority               
                                ///< level.                                                      
#define EIP1_PCP0R__HIGH   0x20 ///< CP0 rising edge interrupt set to high priority              
                                ///< level.                                                      
                                                                                                 
//------------------------------------------------------------------------------
// IE Enums (Interrupt Enable @ 0xA8)
//------------------------------------------------------------------------------
#define IE_EX0__BMASK     0x01 ///< External Interrupt 0 Enable                       
#define IE_EX0__SHIFT     0x00 ///< External Interrupt 0 Enable                       
#define IE_EX0__DISABLED  0x00 ///< Disable external interrupt 0.                     
#define IE_EX0__ENABLED   0x01 ///< Enable interrupt requests generated by the /INT0  
                               ///< input.                                            
                                                                                      
#define IE_ET0__BMASK     0x02 ///< Timer 0 Interrupt Enable                          
#define IE_ET0__SHIFT     0x01 ///< Timer 0 Interrupt Enable                          
#define IE_ET0__DISABLED  0x00 ///< Disable all Timer 0 interrupt.                    
#define IE_ET0__ENABLED   0x02 ///< Enable interrupt requests generated by the TF0    
                               ///< flag.                                             
                                                                                      
#define IE_EX1__BMASK     0x04 ///< External Interrupt 1 Enable                       
#define IE_EX1__SHIFT     0x02 ///< External Interrupt 1 Enable                       
#define IE_EX1__DISABLED  0x00 ///< Disable external interrupt 1.                     
#define IE_EX1__ENABLED   0x04 ///< Enable interrupt requests generated by the /INT1  
                               ///< input.                                            
                                                                                      
#define IE_ET1__BMASK     0x08 ///< Timer 1 Interrupt Enable                          
#define IE_ET1__SHIFT     0x03 ///< Timer 1 Interrupt Enable                          
#define IE_ET1__DISABLED  0x00 ///< Disable all Timer 1 interrupt.                    
#define IE_ET1__ENABLED   0x08 ///< Enable interrupt requests generated by the TF1    
                               ///< flag.                                             
                                                                                      
#define IE_ES0__BMASK     0x10 ///< UART0 Interrupt Enable                            
#define IE_ES0__SHIFT     0x04 ///< UART0 Interrupt Enable                            
#define IE_ES0__DISABLED  0x00 ///< Disable UART0 interrupt.                          
#define IE_ES0__ENABLED   0x10 ///< Enable UART0 interrupt.                           
                                                                                      
#define IE_ET2__BMASK     0x20 ///< Timer 2 Interrupt Enable                          
#define IE_ET2__SHIFT     0x05 ///< Timer 2 Interrupt Enable                          
#define IE_ET2__DISABLED  0x00 ///< Disable Timer 2 interrupt.                        
#define IE_ET2__ENABLED   0x20 ///< Enable interrupt requests generated by the TF2L or
                               ///< TF2H flags.                                       
                                                                                      
#define IE_IEGF0__BMASK   0x40 ///< General Purpose Flag 0                            
#define IE_IEGF0__SHIFT   0x06 ///< General Purpose Flag 0                            
#define IE_IEGF0__NOT_SET 0x00 ///< The flag is not set. Clear the flag.              
#define IE_IEGF0__SET     0x40 ///< The flag is set. Set the flag.                    
                                                                                      
#define IE_EA__BMASK      0x80 ///< All Interrupts Enable                             
#define IE_EA__SHIFT      0x07 ///< All Interrupts Enable                             
#define IE_EA__DISABLED   0x00 ///< Disable all interrupt sources.                    
#define IE_EA__ENABLED    0x80 ///< Enable each interrupt according to its individual 
                               ///< mask setting.                                     
                                                                                      
//------------------------------------------------------------------------------
// IP Enums (Interrupt Priority @ 0xB8)
//------------------------------------------------------------------------------
#define IP_PX0__BMASK 0x01 ///< External Interrupt 0 Priority Control           
#define IP_PX0__SHIFT 0x00 ///< External Interrupt 0 Priority Control           
#define IP_PX0__LOW   0x00 ///< External Interrupt 0 set to low priority level. 
#define IP_PX0__HIGH  0x01 ///< External Interrupt 0 set to high priority level.
                                                                                
