ahtn/keyplus/efm8/efm8/mcu/C8051F300/inc/SI_C8051F300_Register_Enums.h
#define IP_PT0__BMASK 0x02 ///< Timer 0 Interrupt Priority Control              
#define IP_PT0__SHIFT 0x01 ///< Timer 0 Interrupt Priority Control              
#define IP_PT0__LOW   0x00 ///< Timer 0 interrupt set to low priority level.    
#define IP_PT0__HIGH  0x02 ///< Timer 0 interrupt set to high priority level.   
                                                                                
#define IP_PX1__BMASK 0x04 ///< External Interrupt 1 Priority Control           
#define IP_PX1__SHIFT 0x02 ///< External Interrupt 1 Priority Control           
#define IP_PX1__LOW   0x00 ///< External Interrupt 1 set to low priority level. 
#define IP_PX1__HIGH  0x04 ///< External Interrupt 1 set to high priority level.
                                                                                
#define IP_PT1__BMASK 0x08 ///< Timer 1 Interrupt Priority Control              
#define IP_PT1__SHIFT 0x03 ///< Timer 1 Interrupt Priority Control              
#define IP_PT1__LOW   0x00 ///< Timer 1 interrupt set to low priority level.    
#define IP_PT1__HIGH  0x08 ///< Timer 1 interrupt set to high priority level.   
                                                                                
#define IP_PS0__BMASK 0x10 ///< UART0 Interrupt Priority Control                
#define IP_PS0__SHIFT 0x04 ///< UART0 Interrupt Priority Control                
#define IP_PS0__LOW   0x00 ///< UART0 interrupt set to low priority level.      
#define IP_PS0__HIGH  0x10 ///< UART0 interrupt set to high priority level.     
                                                                                
#define IP_PT2__BMASK 0x20 ///< Timer 2 Interrupt Priority Control              
#define IP_PT2__SHIFT 0x05 ///< Timer 2 Interrupt Priority Control              
#define IP_PT2__LOW   0x00 ///< Timer 2 interrupt set to low priority level.    
#define IP_PT2__HIGH  0x20 ///< Timer 2 interrupt set to high priority level.   
                                                                                
//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_XSKP0__BMASK       0x01 ///< Port 0 Bit 0 Skip                       
#define XBR0_XSKP0__SHIFT       0x00 ///< Port 0 Bit 0 Skip                       
#define XBR0_XSKP0__NOT_SKIPPED 0x00 ///< P0.0 pin is not skipped by the crossbar.
#define XBR0_XSKP0__SKIPPED     0x01 ///< P0.0 pin is skipped by the crossbar.    
                                                                                  
#define XBR0_XSKP1__BMASK       0x02 ///< Port 0 Bit 1 Skip                       
#define XBR0_XSKP1__SHIFT       0x01 ///< Port 0 Bit 1 Skip                       
#define XBR0_XSKP1__NOT_SKIPPED 0x00 ///< P0.1 pin is not skipped by the crossbar.
#define XBR0_XSKP1__SKIPPED     0x02 ///< P0.1 pin is skipped by the crossbar.    
                                                                                  
#define XBR0_XSKP2__BMASK       0x04 ///< Port 0 Bit 2 Skip                       
#define XBR0_XSKP2__SHIFT       0x02 ///< Port 0 Bit 2 Skip                       
#define XBR0_XSKP2__NOT_SKIPPED 0x00 ///< P0.2 pin is not skipped by the crossbar.
#define XBR0_XSKP2__SKIPPED     0x04 ///< P0.2 pin is skipped by the crossbar.    
                                                                                  
#define XBR0_XSKP3__BMASK       0x08 ///< Port 0 Bit 3 Skip                       
#define XBR0_XSKP3__SHIFT       0x03 ///< Port 0 Bit 3 Skip                       
#define XBR0_XSKP3__NOT_SKIPPED 0x00 ///< P0.3 pin is not skipped by the crossbar.
#define XBR0_XSKP3__SKIPPED     0x08 ///< P0.3 pin is skipped by the crossbar.    
                                                                                  
#define XBR0_XSKP4__BMASK       0x10 ///< Port 0 Bit 4 Skip                       
#define XBR0_XSKP4__SHIFT       0x04 ///< Port 0 Bit 4 Skip                       
#define XBR0_XSKP4__NOT_SKIPPED 0x00 ///< P0.4 pin is not skipped by the crossbar.
#define XBR0_XSKP4__SKIPPED     0x10 ///< P0.4 pin is skipped by the crossbar.    
                                                                                  
#define XBR0_XSKP5__BMASK       0x20 ///< Port 0 Bit 5 Skip                       
#define XBR0_XSKP5__SHIFT       0x05 ///< Port 0 Bit 5 Skip                       
#define XBR0_XSKP5__NOT_SKIPPED 0x00 ///< P0.5 pin is not skipped by the crossbar.
#define XBR0_XSKP5__SKIPPED     0x20 ///< P0.5 pin is skipped by the crossbar.    
                                                                                  
#define XBR0_XSKP6__BMASK       0x40 ///< Port 0 Bit 6 Skip                       
#define XBR0_XSKP6__SHIFT       0x06 ///< Port 0 Bit 6 Skip                       
#define XBR0_XSKP6__NOT_SKIPPED 0x00 ///< P0.6 pin is not skipped by the crossbar.
#define XBR0_XSKP6__SKIPPED     0x40 ///< P0.6 pin is skipped by the crossbar.    
                                                                                  
//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)
//------------------------------------------------------------------------------
#define XBR1_UTX0E__BMASK           0x01 ///< UART Transmit Output Enable              
#define XBR1_UTX0E__SHIFT           0x00 ///< UART Transmit Output Enable              
#define XBR1_UTX0E__DISABLED        0x00 ///< UART Transmit (TX) unavailable at P0.4.  
#define XBR1_UTX0E__ENABLED         0x01 ///< UART Transmit (TX) routed to P0.4.       
                                                                                       
#define XBR1_URX0E__BMASK           0x02 ///< UART Receive Input Enable                
#define XBR1_URX0E__SHIFT           0x01 ///< UART Receive Input Enable                
#define XBR1_URX0E__DISABLED        0x00 ///< UART Receive (RX) unavailable at P0.5.   
#define XBR1_URX0E__ENABLED         0x02 ///< UART Receive (RX) routed to P0.5.        
                                                                                       
#define XBR1_SMB0E__BMASK           0x04 ///< SMBus0 I/O Enable                        
#define XBR1_SMB0E__SHIFT           0x02 ///< SMBus0 I/O Enable                        
#define XBR1_SMB0E__DISABLED        0x00 ///< SMBus0 I/O unavailable at Port pins.     
#define XBR1_SMB0E__ENABLED         0x04 ///< SMBus0 I/O routed to Port pins.          
                                                                                       
#define XBR1_SYSCKE__BMASK          0x08 ///< SYSCLK Output Enable                     
#define XBR1_SYSCKE__SHIFT          0x03 ///< SYSCLK Output Enable                     
#define XBR1_SYSCKE__DISABLED       0x00 ///< SYSCLK unavailable at Port pin.          
#define XBR1_SYSCKE__ENABLED        0x08 ///< SYSCLK output routed to Port pin.        
                                                                                       
#define XBR1_CP0E__BMASK            0x10 ///< Comparator0 Output Enable                
#define XBR1_CP0E__SHIFT            0x04 ///< Comparator0 Output Enable                
#define XBR1_CP0E__DISABLED         0x00 ///< CP0 unavailable at Port pin.             
#define XBR1_CP0E__ENABLED          0x10 ///< CP0 routed to Port pin.                  
                                                                                       
